Revit 2027 API
AdvancedOpaque Properties
The AdvancedOpaque type exposes the following members.
Properties
Name | Description
OpaqueAlbedo |  The property labeled "Color" from the "AdvancedOpaque" schema.
OpaqueEmission |  The property labeled "Emission" from the "AdvancedOpaque" schema.
OpaqueF0 |  The property labeled "Specular reflectance" from the "AdvancedOpaque" schema.
OpaqueLuminance |  The property labeled "Emissive Luminance" from the "AdvancedOpaque" schema.
OpaqueLuminanceModifier |  The property labeled "Luminance Scale" from the "AdvancedOpaque" schema.
OpaqueMfp |  The property labeled "Translucency Depth" from the "AdvancedOpaque" schema.
OpaqueMfpModifier |  The property labeled "Translucency Weight" from the "AdvancedOpaque" schema.
OpaqueTranslucency |  The property labeled "Translucency" from the "AdvancedOpaque" schema.
SurfaceAlbedo |  The property labeled "Color" from the "AdvancedOpaque" schema.
SurfaceAnisotropy |  The property labeled "Anisotropy" from the "AdvancedOpaque" schema.
SurfaceCutout |  The property labeled "Image" from the "AdvancedOpaque" schema.
SurfaceNdfType |  The property labeled "NDF" from the "AdvancedOpaque" schema.
SurfaceNormal |  The property labeled "Image" from the "AdvancedOpaque" schema.
SurfaceRotation |  The property labeled "Rotation" from the "AdvancedOpaque" schema.
SurfaceRoughness |  The property labeled "Roughness" from the "AdvancedOpaque" schema.
Top
See Also
Reference
AdvancedOpaque Class
Autodesk.Revit.DB.Visual Namespace